[
{"category": "Relative clause", "name": "who", "structure": [""], "explanation": ["thay thế cho người, làm chủ ngữ trong mệnh đề quan hệ."], "example": ["I need to meet the boy. The boy is my son's friend. \n", "\n", "-> I need to meet the bot who is my son's friend."]},
{"category": "Relative clause", "name": "whom", "structure": [""], "explanation": ["Thay thế cho người, làm tân ngữ trong mệnh đề quan hệ."], "example": ["I know the girl. I spoke to this girl \n", "\n", "-> I know the girl whom I spoke to."]},
{"category": "Relative clause", "name": "which", "structure": [""], "explanation": ["Thay thế cho vật, đồ vật, làm chủ ngữ, tân ngữ trong mệnh đề quan hệ."], "example": ["She works for a company. It makes cars. \n", "\n", "-> She works for a company which makes cars."]},
{"category": "Relative clause", "name": "that", "structure": [""], "explanation": ["Thay thế cho người, vật làm chủ ngữ, tân ngữ trong mệnh đề quan hệ."], "example": ["I need to meet the boy that is my friend's son. \n", "\n", "I know the girl that I spoke to."]},
{"category": "Relative clause", "name": "whose", "structure": [""], "explanation": ["Thay thế cho sở hữu của người, vật (his, her, its, their)"], "example": ["John found the cat. Its leg was broken. \n", "\n", "-> John found the cat whose leg was broken."]},
{"category": "Relative clause", "name": "where", "structure": [""], "explanation": ["Thay thé cho cụm từ chỉ nơi chốn (there, at that plae)."], "example": ["The movie theater is the place. We go there once a week. \n", "\n", "-> The movie theater is the place where we go once a week."]},
{"category": "Relative clause", "name": "why", "structure": [""], "explanation": ["Thay thế cho cụm trạng từ chỉ lí do : for that reason."], "example": ["Tell me the reason. You are so sad for that reason. \n", "\n", "-> Tell me the reason why you are so sad."]},
{"category": "Relative clause", "name": "when", "structure": [""], "explanation": ["Thay thế cho cụm từ chỉ thời gian : then, at that time, on that day."], "example": ["Do you remember the day. We first met on that day. \n", "\n", "-> Do you remember the day when we first met."]}
]