[
{"category": "Tense", "name": "Present Simple", "structure": ["(+) S + V(e/es) + O\n", "(-) S + don't/doesn't + V + O\n", "(?) Do/ Does + S + V + O ?"], "explanation": ["- Dùng để diễn tả thói quen hoặc những việc thường xuyên xảy ra ở hiện tại\n", "- Dùng để diễn tả những sự vật, sự việc xảy ra mang tính quy luật\n", "- Dùng để diễn tả các sự thật hiển nhiên, một chân lý, các phong tục tập quán, các hiện tượng tự nhiên.\n", "- Dùng để diễn tả lịch trình của tàu, xe, máy bay,…"], "example": ["- We go to school every day. (Tôi đi học mỗi ngày) \n", "- This festival occur every 3 years. (Lễ hội này diễn ra 3 năm một lần.)\n", "- The earth moves around the Sun. (Trái đất quay quanh mặt trời)\n", "- The train leaves at 8 am tomorrow. (Tàu khởi hành lúc 8 giờ sáng mai.)\n"]},
{"category": "Tense", "name": "Present Progressive", "structure": ["(+) S + am/ is/ are + V-ing \n", "(-) S + am/ is/ are + not + V-ing \n", "(?) Am/ Is/ Are + S + V-ing ?"], "explanation": ["- Diễn tả một hành động đang xảy ra ngay tại thời điểm nói.\n", "- Diễn tả một sự việc sẽ xảy ra trong tương lai theo một kế hoạch đã được lên lịch cố định.\n", "Diễn tả sự không hài lòng hay phàn nàn về việc gì trong câu sử dụng “always”."], "example": ["- I am looking for a new job. (Tôi đang tìm kiếm một công việc mới.) \n", "- I bought the ticket yesterday. I am flying to New York tomorrow. \n", "- She is always going to school at 6.30 am (Cô ấy luôn đi học vào lúc 6.30)"]},
{"category": "Tense", "name": "Present Perfect", "structure": ["(+) S + have/has + Vp2 + O\n", "(-) S + haven't/ hasn't + Vp2 + O\n", "(?) Have/has + S + Vp2 + O?"], "explanation": ["- Hành động đã hoàn thành cho tới thời điểm hiện tại mà không đề cập tới nó xảy ra khi nào.\n", "- Hành động bắt đầu ở quá khứ và đang tiếp tục ở hiện tại \n", "- Hành động đã từng làm trước đây và bây giờ vẫn còn làm\n", "- Một kinh nghiệm cho tới thời điểm hiện tại (thường dùng trạng từ ever)\n", "- Về một hành động trong quá khứ nhưng quan trọng tại thời điểm nói"], "example": ["- I’ve done all my homeworks / Tôi đã làm hết bài tập về nhà\n", "- She has lived in Liverpool all her life/ Cố ấy đã sống cả đời ở Liverpool.\n", "- He has written three books and he is working on another book/ Anh ấy đã viết được 3 cuốn sách và đang viết cuốn tiếp theo\n", "- My last birthday was the best day I’ve ever had./ Sinh nhật năm ngoái là ngày tuyệt nhất đời tôi.\n", "- I can’t get my house. I’ve lost my keys. /Tôi không thể vào nhà được. Tôi đánh mất chùm chìa khóa của mình rồi."]},
{"category": "Tense", "name": "Present Perfect Progressive", "structure": ["(+) S + has/have + been+ V-ing + O\n", "(-) S + have not/has not (haven’t/hasn’t) + been + V-ing + O\n", "(?) Have/has + S + been + Ving + O?\n", "(?) Wh question + have/has + S + been + Ving + O?"], "explanation": ["- Diễn tả tính liên tục của một hành động xảy ra trong quá khứ , còn tiếp diễn ở hiện tại và có thể lan đến tương lai.\n", "- Sự việc đã kết thúc nhưng chúng ta vẫn còn thấy kế quả hay dấu vết của nó\n", "- Chỉ sự việc lặp đi lặp lại nhiều lần trong quá khứ và còn có xu hướng tiếp tục ở hiện tại\n", "- Rút ra một kết luận dựa vào kết quả ở hiện tại\n", "- Thì hiện tại hoàn thành tiếp diễn nhấn mạnh về khoảng thời gian"], "example": ["- It has been raining all day \n", "- Why are your hands so dirty? - I have been repairing my bike\n", "- I have been reading this book 4 times\n", "- She looks exhausted because she has been working all night\n", "- We have been waiting for her for 30 minutes"]},
{"category": "Tense", "name": "Past Simple", "structure": ["(+) S + V-ed/P1 + O\n", "(-) S + didn't + V + O\n", "(?)Wh-question + did + S + V?"], "explanation": ["-Dùng để diễn tả một hành động đã xảy ra và kết thúc trong quá khứ.\n", "- Diễn tả một sự việc xảy ra trong một khoảng thời gian trong quá khứ và đã kết thúc hoàn toàn ở hiện tại\n", "- Diễn tả một loạt hành động xảy ra kế tiếp nhau trong quá khứ\n", "- Diễn tả một hành động chen ngang vào hành động khác đang xảy ra trong quá khứ (quá khứ đơn dùng kết hợp với quá khứ tiếp diễn)"], "example": ["- They went to the concert last night. (Họ đã tới rạp hát tối hôm qua.)\n", "- When I was young, I often played soccer (Khi tôi còn trẻ, tôi thường chơi đá bóng)\n", "- She came home, switched on the computer and checked information \n", "(Cô ấy về nhà, khởi động máy tính và kiểm tra hộp thư điện tử của mình)\n", "- When I was reading book, my dad called me (Khi tôi đang đọc sách, bố tôi đã gọi)"]},
{"category": "Tense", "name": "Past continous", "structure": ["(+) S + was/were + V-ing +O \n", "(-) S + wasn't/weren't + V-ing + O \n", "(?) Wh - question + was/were + S + V-ing?"], "explanation": ["- Thì quá khứ tiếp diễn mô tả một hành động đang diễn tiến tại một thời điểm cụ thể trong quá khứ\n", "- Hành động đang diễn tiến liên tục trong một khoảng thời gian nhằm nhấn mạnh tính liên tục của nó\n", "- Một hành động đang diễn ra trong quá khứ thì có hành động khác xen vào\n", "- Hai hành động xảy ra đồng thời trong quá khứ\n", "- Hành động lặp đi lặp lại trong quá khứ và làm phiền đến người khác"], "example": ["- When I left home, my mother was cleaning my house\n", "- I was singing all day yesterday (Tôi đã hát liên tục trong ngày hôm qua)\n", "- I was walking in the park when I suddenly fell over (Tôi đang đi bộ trong công viên thì bất ngờ vấp ngã)\n", "- While I was cooking, my father was having shower (Trong khi tôi nấu ăn thì bố tôi đang tắm)\n", "- When she worked here, she was always making noise (Khi cô ta còn làm việc ở đây, cô ta thường xuyên làm ồn)"]},
{"category": "Tense", "name": "Past perfect", "structure": ["(+) S + had + V-P2\n", "(-) S + hadn't (had not) + V-P2\n", "(?) Had + S + V-P2? -> Yes/No, S + had/hadn't"], "explanation": ["- Khi có một hành động xảy ra và hoàn thành trước một hành động khác trong quá khứ\n", "- Hành động xảy ra một khoảng thời gian trong quá khứ, trước một mốc thời gian khác\n", "- Hành động xảy ra như là điều kiện tiên quyết cho hành động khác"], "example": ["- He had gone to school before Sarah came\n", "- I had lived abroad for three years when I received the letter from my best friend. (Tôi đã sống ở nước ngoài được hai năm trước khi nhận được thư từ bạn thân)\n", "- My younger brother had prepared for the exams and was ready to do well. (Em trai tôi đã chuẩn bị kĩ càng cho bài kiểm tra và sẵn sàng để làm tốt)"]},
{"category": "Tense", "name": "Past perfet continous", "structure": ["(+) S + had + been + V-ing \n", "(-) S + hadn't + been + V-ing \n", "(?) Had + S + been + V-ing? -> Yes/No, S + had/hadn't"], "explanation": ["- Diễn tả một hành động xảy ra kéo dài liên tục trước một hành động khác trong quá khứ.\n", "- Diễn tả một hành động xảy ra kéo dài liên tục trước một thời điểm xác định trong quá khứ.\n", "- Nhấn mạnh hành động để lại kết quả trong quá khứ."], "example": ["- He had been typing for 3 hours before he finshed his work. (Cậu ta đã đánh máy suốt 3 tiếng đồng hồ trước khi hoàn thành xong công việc.)\n", "- My father had been driving for 2 hours before 11pm last night. (Bố tôi đã lái xe liên tục 2 tiếng đồng hồ trước thời điểm 11h tối hôm qua.) \n", "- This morning he was very tired because he had been working very hard all night. (Sáng nay anh ấy rất mệt bởi vì anh ấy đã làm việc vất vả cả đêm.)"]},
{"category": "Tense", "name": "Future Simple", "structure": ["(+) S + will + V nguyên thể \n", "(-) S + will not (won't) + V nguyên thể \n", "(?) Will + S + V nguyên thể? -> Yes/No, S + will/ won't"], "explanation": ["- Diễn tả một quyết định, một ý định nhất thời nảy ra ngay tại thời điểm nói.\n", "- Diễn tả một dự đoán không có căn cứ. \n", "- Diễn tả một lời hứa hay lời yêu cầu, đề nghị.\n", "- Sử dụng trong câu điều kiện loại một, diễn tả một giả định có thể xảy ra ở hiện tại và tương lai."], "example": ["- Are you going to the park now? - I will go with you. (Bây giờ bạn đang tới công viên à? Tớ sẽ đi với bạn.)\n", "- I think she will come to the party. (Tôi nghĩ rằng cô ấy sẽ tới bữa tiệc.)\n", "- I promise that I will tell you the truth. (Tôi hứa là tôi sẽ nói với bạn sự thật.)\n", "- If she comes, I will go with her. (Nếu cô ấy đến, tôi sẽ đi với cô ấy.)"]},
{"category": "Tense", "name": "Future Progressive", "structure": ["(+) S + will + be + V-ing \n", "(-) S + won't + be + V-ing \n", "(?) Will + S + be + V-ing? -> Yes/No, S + will/ won't"], "explanation": ["- Diễn tả một hành động sẽ diễn ra và kéo dài liên tục trong một khoảng thời gian trong tương lai\n", "- Diễn tả hành động trong tương lai đang xảy ra thì một hành động khác xảy đến\n", "- Diễn tả hành động sẽ xảy ra vào một thời điểm xác định hoặc một khoảng thời gian cụ thể trong tương lai\n", "- Diễn tả một hành động sẽ xảy ra như một phần của kế hoạch hoặc nằm trong thời gian biểu"], "example": ["- My parents are going to aboard, so I’ll be staying with my grandma for the next 2 weeks.(Bố mẹ tôi sẽ đi nước ngoài, nên tôi sẽ phải ở với bà trong khoảng 2 tuần)\n", "- At this time tomorrow I will be going out with my friend while my younger brother will be doing his homework.\n", "- At this time next week, I will be flying to Japan. (Vào thời gian này tuần tiếp, tôi \n", "sẽ bay đến Nhật Bản)\n", "- The party will be starting at six thirty. (Bữa tiệc sẽ bắt đầu lúc 6 giờ 30 phút)"]},
{"category": "Tense", "name": "Future Perfect", "structure": ["(+) S + will + have + Vp2 \n", "(-) S + won't + have + Vp2 \n", "(?) Will + S + have + Vp2? -> Yes/No, S + will/ won't."], "explanation": ["- Dùng để diễn tả một hành động hay sự việc hoàn thành trước một thời điểm trong tương lai.\n", "- Dùng để diễn tả một hành động hay sự việc hoàn thành trước một hành động hay sự việc khác trong tương lai:"], "example": ["- I will have finished my homework before 9 o’clock this evening.\n", "- I will have made the meal ready before the time you come tomorrow."]},
{"category": "Tense", "name": "Future perfect continous", "structure": ["(+) S + will have been + Ving \n", "(-) S + won't have been + Ving \n", "(?) Will + S + have been + Ving? -> Yes/No, S + will/ won't."], "explanation": ["- Diễn tả 1 hành động bắt đầu từ quá khứ và kéo dài đến 1 thời điểm cho trước ở tương lai, và vẫn chưa hoàn thành."], "example": ["- By November, we’ll have been living in this house for 10 years."]},
{"category": "Tense", "name": "Near Future", "structure": ["(+) S + is/are/am + going to + V nguyên thể \n", "(-) S + is/are/am not + going to + V nguyên thể \n", "(?) s/are/am + S + going to + V nguyên thể -> Yes/No, S + is,are,am/ is,are,am not"], "explanation": ["- Dùng để diễn tả một dự định, kế hoạch trong tương lai.\n", "- Dùng để diễn đạt một dự đoán có căn cứ, có dẫn chứng cụ thể."], "example": ["- I am going to get married this year. (Tôi dự định sẽ kết hôn trong năm nay.)\n", "- Look at those dark clouds! I thinh that It is going to rain. (Hãy nhìn những đám mây kia kìa! Tôi nghĩ là trời sắp mưa đấy.)"]},
{"category": "comparative sentences", "name": "superlative", "structure": ["- Tính từ, phó từ ngắn: S + V + the + adj/adv - est + in/of + N\n", "- Tính từm phó từ dài: S + V + the most/least + adj/adv + in/of + N"], "explanation": ["So sánh nhất dùng khi so sánh 3 đối tượng trở lên, trong đó có 1 đối tượng là ưu việt nhất so với những đối tượng còn lại về mọi mặt."], "example": ["- John is the tallest boy in the family (John là cậu bé cao nhất nhà)\n", "- All of students, he is the least intelligent. (Anh ấy thông minh nhất trong tất cả học sinh)"]},
{"category": "comparative sentences", "name": "Equal Comparison", "structure": ["S + V + as + adj/adv + as + N/ P (giống như, bằng như)"], "explanation": ["So sánh 2 sự vật giống nhau"], "example": ["My book is as interesting as yours (Sách của tôi thú vị như sách của bạn)"]},
{"category": "comparative sentences", "name": "comparative", "structure": ["- Tính từ, phó từ ngắn: S + V + adj/adv - er + than + N/P\n", "- Tính từ, phó từ dài: S + V + more/less + adj/adv + than + N/P"], "explanation": ["So sánh 2 sự vật hơn-kém"], "example": ["- Today is hotter than yesterday (Hôm nay nóng hơn hôm qua)\n", "- He speaks English more fluently than I (Anh ấy nói tiếng Anh trôi chảy hơn tôi)"]},
{"category": "Conditional sentences", "name": "The conditional sentence type 0", "structure": ["If + S + V / V (s/es) + O, S + V / V(s/es) + O"], "explanation": ["- Dùng để giả định một chân lý, một sự thật hiển nhiên. \n", "- Dung để giả định một lời hướng dẫn, chỉ dẫn có tính chất mệnh lệnh, bắt buộc."], "example": ["- If you heat the ice, it melts (nếu như bạt làm nóng băng, nó sẽ tan chảy). \n", "- If you are absent too much, you fail the subject."]},
{"category": "Conditional sentences", "name": "The conditional sentence type 1", "structure": ["If + S + V1 (chia ở thì hiện tại đơn), S + will (not) + V2 nguyên thể"], "explanation": ["Dùng để giả định về một sự việc có thể xảy ra ở hiện tại hoặc tương lai."], "example": ["- If she comes, I will go with her. (Nếu cô ấy đến, tôi sẽ đi với cô ấy)"]},
{"category": "Conditional sentences", "name": "The conditional sentence type 2", "structure": ["If + S + V (chia ở thì quá khứ đơn), S + would/should (not) + V(nguyên thể)"], "explanation": ["Câu điều kiện loại 2 dùng để giả định về một sự việc không thể xảy ra ở hiện tại hoặc tương"], "example": ["If they had a lot of money now, they would travel around the world. (Nếu bây giờ họ có nhiều tiền, họ sẽ đi du lịch vòng quanh thế giới.)"]},
{"category": "Conditional sentences", "name": "The conditional sentence type 3", "structure": ["If S + V ( chia ở thì quá khứ hoàn thành), S + would have (wouldn't have) + Vp2"], "explanation": ["Câu điều kiện loại 3 dùng để giả định về một sự việc trái với sự thật trong quá khứ."], "example": ["If He had told me the truth yesterday, I would have helped him."]},
{"category": "Relative clause", "name": "who", "structure": [""], "explanation": ["thay thế cho người, làm chủ ngữ trong mệnh đề quan hệ."], "example": ["I need to meet the boy. The boy is my son's friend. \n", "\n", "-> I need to meet the bot who is my son's friend."]},
{"category": "Relative clause", "name": "whom", "structure": [""], "explanation": ["Thay thế cho người, làm tân ngữ trong mệnh đề quan hệ."], "example": ["I know the girl. I spoke to this girl \n", "\n", "-> I know the girl whom I spoke to."]},
{"category": "Relative clause", "name": "which", "structure": [""], "explanation": ["Thay thế cho vật, đồ vật, làm chủ ngữ, tân ngữ trong mệnh đề quan hệ."], "example": ["She works for a company. It makes cars. \n", "\n", "-> She works for a company which makes cars."]},
{"category": "Relative clause", "name": "that", "structure": [""], "explanation": ["Thay thế cho người, vật làm chủ ngữ, tân ngữ trong mệnh đề quan hệ."], "example": ["I need to meet the boy that is my friend's son. \n", "\n", "I know the girl that I spoke to."]},
{"category": "Relative clause", "name": "whose", "structure": [""], "explanation": ["Thay thế cho sở hữu của người, vật (his, her, its, their)"], "example": ["John found the cat. Its leg was broken. \n", "\n", "-> John found the cat whose leg was broken."]},
{"category": "Relative clause", "name": "where", "structure": [""], "explanation": ["Thay thé cho cụm từ chỉ nơi chốn (there, at that plae)."], "example": ["The movie theater is the place. We go there once a week. \n", "\n", "-> The movie theater is the place where we go once a week."]},
{"category": "Relative clause", "name": "why", "structure": [""], "explanation": ["Thay thế cho cụm trạng từ chỉ lí do : for that reason."], "example": ["Tell me the reason. You are so sad for that reason. \n", "\n", "-> Tell me the reason why you are so sad."]},
{"category": "Relative clause", "name": "when", "structure": [""], "explanation": ["Thay thế cho cụm từ chỉ thời gian : then, at that time, on that day."], "example": ["Do you remember the day. We first met on that day. \n", "\n", "-> Do you remember the day when we first met."]}
]